{"config": {"layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 784], "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "name": "dense", "dtype": "float32", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "units": 256, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dense"}, {"config": {"rate": 0.050000000000000044, "dtype": "float32", "noise_shape": null, "name": "dropout", "trainable": true, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["dense", 0, 0, {}]]], "name": "dropout"}, {"config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "name": "dense_1", "dtype": "float32", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "units": 256, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "dense_1"}, {"config": {"rate": 0.050000000000000044, "dtype": "float32", "noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1"}, {"config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "name": "dense_2", "dtype": "float32", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "softmax", "units": 10, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "name": "model", "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.1.6-tf", "class_name": "Model", "backend": "tensorflow"}